{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "input_dtype": "float32", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "nb_filter": 32, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "activation": "relu", "nb_col": 3, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "name": "convolution2d_1", "batch_input_shape": [null, 32, 16, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "nb_filter": 64, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "activation": "relu", "nb_col": 3, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "name": "convolution2d_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_2"}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "nb_filter": 128, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "activation": "relu", "nb_col": 3, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "name": "convolution2d_3"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "W_constraint": null, "input_dim": 1024, "b_regularizer": null, "init": "glorot_uniform", "output_dim": 1024, "activation": "relu", "trainable": true, "b_constraint": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "W_constraint": null, "input_dim": 1024, "b_regularizer": null, "init": "glorot_uniform", "output_dim": 512, "activation": "relu", "trainable": true, "b_constraint": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "L1L2Regularizer", "l1": 0.0}, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "W_constraint": null, "input_dim": 512, "b_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null, "name": "dense_3"}}]}