{"config": [{"config": {"border_mode": "same", "init": "glorot_uniform", "trainable": true, "nb_col": 3, "activation": "relu", "input_dtype": "float32", "name": "convolution2d_1", "b_constraint": null, "batch_input_shape": [null, 32, 16, 3], "nb_filter": 32, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "same", "init": "glorot_uniform", "trainable": true, "nb_col": 3, "activation": "relu", "input_dtype": "float32", "name": "convolution2d_2", "b_constraint": null, "batch_input_shape": [null, 32, 32, 3], "nb_filter": 32, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "same", "init": "glorot_uniform", "trainable": true, "nb_col": 3, "activation": "relu", "name": "convolution2d_3", "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "bias": true, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "same", "init": "glorot_uniform", "trainable": true, "nb_col": 3, "activation": "relu", "name": "convolution2d_4", "b_constraint": null, "activity_regularizer": null, "nb_filter": 128, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "bias": true, "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "trainable": true, "activation": "relu", "output_dim": 1024, "name": "dense_1", "b_constraint": null, "activity_regularizer": null, "input_dim": 256, "W_regularizer": null, "bias": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "trainable": true, "activation": "relu", "output_dim": 512, "name": "dense_2", "b_constraint": null, "activity_regularizer": null, "input_dim": 1024, "W_regularizer": null, "bias": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "trainable": true, "activation": "linear", "output_dim": 1, "name": "output", "b_constraint": null, "activity_regularizer": null, "input_dim": 512, "W_regularizer": null, "bias": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}