{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "W_constraint": null, "batch_input_shape": [null, 32, 32, 3], "border_mode": "same", "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "nb_col": 3, "dim_ordering": "tf", "activity_regularizer": null, "input_dtype": "float32", "bias": true, "nb_row": 3, "nb_filter": 32, "init": "glorot_uniform", "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "W_constraint": null, "border_mode": "same", "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "nb_col": 3, "dim_ordering": "tf", "activity_regularizer": null, "nb_filter": 64, "bias": true, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "W_constraint": null, "border_mode": "same", "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "nb_col": 3, "dim_ordering": "tf", "activity_regularizer": null, "nb_filter": 128, "bias": true, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null, "output_dim": 1024, "activity_regularizer": null, "input_dim": 2048, "bias": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null, "output_dim": 512, "activity_regularizer": null, "input_dim": 1024, "bias": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "output", "activation": "linear", "W_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null, "output_dim": 1, "activity_regularizer": null, "input_dim": 512, "bias": true, "init": "glorot_uniform", "b_regularizer": null}}]}