{"keras_version": "1.2.0", "config": [{"config": {"batch_input_shape": [null, 32, 16, 1], "border_mode": "same", "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "nb_row": 3, "trainable": true, "bias": true, "activation": "relu", "W_regularizer": null, "input_dtype": "float32", "W_constraint": null, "name": "convolution2d_1", "nb_filter": 32, "nb_col": 3, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 64, "border_mode": "same", "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 3, "bias": true, "activation": "relu", "b_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "nb_col": 3, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 128, "border_mode": "same", "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "nb_row": 3, "bias": true, "activation": "relu", "b_regularizer": null, "W_constraint": null, "name": "convolution2d_3", "nb_col": 3, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 1024, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "bias": true, "activation": "relu", "init": "glorot_uniform", "input_dim": 1024, "W_constraint": null, "name": "dense_1", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 512, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "bias": true, "activation": "relu", "init": "glorot_uniform", "input_dim": 1024, "W_constraint": null, "name": "dense_2", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"output_dim": 1, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "bias": true, "activation": "linear", "init": "glorot_uniform", "input_dim": 512, "W_constraint": null, "name": "output", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}