{"config": [{"config": {"gamma_regularizer": null, "input_dtype": "float32", "beta_regularizer": null, "mode": 0, "epsilon": 0.001, "name": "batchnormalization_1", "momentum": 0.99, "batch_input_shape": [null, 64, 64, 3], "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "activation": "relu", "bias": true, "subsample": [1, 1], "b_regularizer": null, "nb_col": 3, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "W_regularizer": null, "name": "convolution2d_1", "nb_filter": 32, "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "epsilon": 0.001, "name": "batchnormalization_2", "momentum": 0.99, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "activation": "relu", "bias": true, "subsample": [1, 1], "b_regularizer": null, "nb_col": 3, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "W_regularizer": null, "name": "convolution2d_2", "nb_filter": 64, "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "epsilon": 0.001, "name": "batchnormalization_3", "momentum": 0.99, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "activation": "relu", "bias": true, "subsample": [1, 1], "b_regularizer": null, "nb_col": 3, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "W_regularizer": null, "name": "convolution2d_3", "nb_filter": 128, "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "activation": "relu", "bias": true, "input_dim": 8192, "b_regularizer": null, "output_dim": 1024, "b_constraint": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "name": "dense_1", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "activation": "relu", "bias": true, "input_dim": 1024, "b_regularizer": null, "output_dim": 512, "b_constraint": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "name": "dense_2", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "activation": "linear", "bias": true, "input_dim": 512, "b_regularizer": null, "output_dim": 1, "b_constraint": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "name": "output", "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}