{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "nb_filter": 32, "batch_input_shape": [null, 32, 16, 3], "input_dtype": "float32", "activity_regularizer": null, "W_constraint": null, "bias": true, "dim_ordering": "tf", "activation": "linear", "name": "convolution2d_1", "border_mode": "same", "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "nb_row": 3, "trainable": true, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_col": 3, "nb_filter": 64, "activity_regularizer": null, "W_constraint": null, "bias": true, "dim_ordering": "tf", "activation": "linear", "name": "convolution2d_2", "border_mode": "same", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_row": 3, "trainable": true, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_col": 3, "nb_filter": 128, "activity_regularizer": null, "W_constraint": null, "bias": true, "dim_ordering": "tf", "activation": "linear", "name": "convolution2d_3", "border_mode": "same", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_row": 3, "trainable": true, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 1024, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "output_dim": 1024, "bias": true, "name": "dense_1", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 1024, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "output_dim": 512, "bias": true, "name": "dense_2", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_5", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 512, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "output_dim": 1, "bias": true, "name": "output", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true}}]}