{"keras_version": "1.2.1", "config": [{"config": {"nb_filter": 32, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "batch_input_shape": [null, 32, 32, 1], "activation": "relu", "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_1", "input_dtype": "float32", "border_mode": "same", "dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 32, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "batch_input_shape": [null, 32, 32, 3], "activation": "relu", "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "input_dtype": "float32", "border_mode": "same", "dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 64, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_row": 3, "trainable": true, "activation": "relu", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "border_mode": "same", "nb_col": 3, "name": "convolution2d_3", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 128, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_row": 3, "trainable": true, "activation": "relu", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "border_mode": "same", "nb_col": 3, "name": "convolution2d_4", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_4", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "input_dim": 512, "output_dim": 1024, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true, "name": "dense_1", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "input_dim": 1024, "output_dim": 512, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "activation": "relu", "W_regularizer": null, "trainable": true, "name": "dense_2", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "input_dim": 512, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "activation": "linear", "W_regularizer": null, "trainable": true, "name": "output", "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}