{"config": [{"config": {"name": "convolution2d_1", "W_constraint": null, "input_dtype": "float32", "nb_col": 8, "batch_input_shape": [null, 32, 16, 3], "dim_ordering": "tf", "subsample": [4, 4], "nb_row": 8, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "nb_filter": 16, "init": "glorot_uniform", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "convolution2d_2", "W_constraint": null, "border_mode": "same", "nb_col": 5, "dim_ordering": "tf", "subsample": [2, 2], "nb_row": 5, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "nb_filter": 32, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "convolution2d_3", "W_constraint": null, "border_mode": "same", "nb_col": 5, "dim_ordering": "tf", "subsample": [2, 2], "nb_row": 5, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "nb_filter": 64, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dense_1", "W_constraint": null, "output_dim": 512, "input_dim": 128, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dense_2", "W_constraint": null, "output_dim": 1, "input_dim": 512, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}