{"keras_version": "1.2.1", "config": [{"config": {"dim_ordering": "tf", "nb_filter": 32, "init": "glorot_uniform", "batch_input_shape": [null, 32, 16, 3], "nb_row": 3, "b_regularizer": null, "name": "convolution2d_1", "W_constraint": null, "activity_regularizer": null, "activation": "relu", "input_dtype": "float32", "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "trainable": true, "b_constraint": null, "bias": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "nb_filter": 64, "init": "glorot_uniform", "name": "convolution2d_2", "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "relu", "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "trainable": true, "b_constraint": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "nb_filter": 128, "init": "glorot_uniform", "name": "convolution2d_3", "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "relu", "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "trainable": true, "b_constraint": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "name": "dense_1", "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "relu", "trainable": true, "input_dim": 1024, "output_dim": 1024, "bias": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "name": "dense_2", "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "relu", "trainable": true, "input_dim": 1024, "output_dim": 512, "bias": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "name": "output", "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "trainable": true, "input_dim": 512, "output_dim": 1, "bias": true, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}