{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "activation": "relu", "input_dtype": "float32", "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "batch_input_shape": [null, 32, 16, 3], "name": "convolution2d_1", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "nb_filter": 32, "W_regularizer": null, "subsample": [1, 1], "trainable": true, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "relu", "border_mode": "same", "init": "glorot_uniform", "bias": true, "b_constraint": null, "b_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "nb_filter": 64, "W_regularizer": null, "subsample": [1, 1], "trainable": true, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activation": "relu", "border_mode": "same", "init": "glorot_uniform", "bias": true, "b_constraint": null, "b_regularizer": null, "name": "convolution2d_3", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "nb_filter": 128, "W_regularizer": null, "subsample": [1, 1], "trainable": true, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activation": "relu", "input_dim": 1024, "init": "glorot_uniform", "output_dim": 1024, "b_constraint": null, "b_regularizer": null, "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null}}, {"class_name": "Dense", "config": {"bias": true, "activation": "relu", "input_dim": 1024, "init": "glorot_uniform", "output_dim": 512, "b_constraint": null, "b_regularizer": null, "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "input_dim": 512, "init": "glorot_uniform", "output_dim": 1, "b_constraint": null, "b_regularizer": null, "name": "output", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null}}]}