{"config": [{"config": {"W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "bias": true, "name": "convolution2d_1", "nb_filter": 32, "init": "glorot_uniform", "activation": "relu", "input_dtype": "float32", "W_regularizer": null, "nb_col": 3, "border_mode": "same", "batch_input_shape": [null, 32, 32, 3], "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "bias": true, "name": "convolution2d_2", "nb_filter": 32, "init": "glorot_uniform", "activation": "relu", "input_dtype": "float32", "W_regularizer": null, "nb_col": 3, "border_mode": "same", "batch_input_shape": [null, 32, 32, 3], "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "bias": true, "name": "convolution2d_3", "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "nb_col": 3, "border_mode": "same", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "bias": true, "name": "convolution2d_4", "nb_filter": 128, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "nb_col": 3, "border_mode": "same", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "input_dim": 512, "b_constraint": null, "bias": true, "name": "dense_1", "output_dim": 1024, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "input_dim": 1024, "b_constraint": null, "bias": true, "name": "dense_2", "output_dim": 512, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "input_dim": 512, "b_constraint": null, "bias": true, "name": "output", "output_dim": 1, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}