{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_1", "input_dtype": "float32", "nb_col": 3, "activation": "relu", "b_constraint": null, "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "batch_input_shape": [null, 32, 16, 3], "nb_filter": 32, "activity_regularizer": null, "b_regularizer": null, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_2", "subsample": [1, 1], "nb_col": 3, "activation": "relu", "b_constraint": null, "border_mode": "same", "W_constraint": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_filter": 64, "activity_regularizer": null, "b_regularizer": null, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "maxpooling2d_2", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_3", "subsample": [1, 1], "nb_col": 3, "activation": "relu", "b_constraint": null, "border_mode": "same", "W_constraint": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_filter": 128, "activity_regularizer": null, "b_regularizer": null, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "maxpooling2d_3", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "output_dim": 1024, "input_dim": 1024, "activation": "relu", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_2", "output_dim": 512, "input_dim": 1024, "activation": "relu", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "name": "output", "output_dim": 1, "input_dim": 512, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null}}]}