{"config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "nb_row": 3, "activity_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 64, 64, 3], "b_regularizer": null, "activation": "relu", "init": "glorot_uniform", "input_dtype": "float32", "nb_col": 3, "subsample": [1, 1], "nb_filter": 32, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "bias": true, "border_mode": "same"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_row": 3, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "subsample": [1, 1], "nb_filter": 64, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "bias": true, "border_mode": "same"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_row": 3, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "subsample": [1, 1], "nb_filter": 128, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "bias": true, "border_mode": "same"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "input_dim": 8192, "output_dim": 1024, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "bias": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "activity_regularizer": null, "input_dim": 1024, "output_dim": 512, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "bias": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "output", "activity_regularizer": null, "input_dim": 512, "output_dim": 1, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "bias": true, "b_constraint": null}}], "class_name": "Sequential", "keras_version": "1.2.0"}