{"config": [{"config": {"input_dtype": "float32", "bias": true, "subsample": [1, 1], "W_constraint": null, "activation": "relu", "trainable": true, "b_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_col": 3, "b_constraint": null, "batch_input_shape": [null, 32, 16, 3], "nb_row": 3, "activity_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_1", "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias": true, "subsample": [1, 1], "activation": "relu", "trainable": true, "b_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_row": 3, "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "W_constraint": null, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias": true, "subsample": [1, 1], "activation": "relu", "trainable": true, "b_regularizer": null, "W_regularizer": null, "border_mode": "same", "nb_row": 3, "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "W_constraint": null, "nb_filter": 128}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_3", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "name": "dense_1", "output_dim": 1024, "trainable": true, "b_regularizer": null, "activation": "relu", "input_dim": 1024, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"bias": true, "name": "dense_2", "output_dim": 512, "trainable": true, "b_regularizer": null, "activation": "relu", "input_dim": 1024, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "output", "output_dim": 1, "trainable": true, "b_regularizer": null, "activation": "linear", "input_dim": 512, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}