{"config": [{"config": {"bias": true, "W_constraint": null, "border_mode": "same", "subsample": [1, 1], "nb_row": 3, "input_dtype": "float32", "init": "glorot_uniform", "b_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "dim_ordering": "tf", "name": "convolution2d_1", "trainable": true, "W_regularizer": null, "nb_filter": 32, "activation": "relu", "activity_regularizer": null, "nb_col": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias": true, "W_constraint": null, "border_mode": "same", "subsample": [1, 1], "nb_row": 3, "input_dtype": "float32", "init": "glorot_uniform", "b_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "dim_ordering": "tf", "name": "convolution2d_2", "trainable": true, "W_regularizer": null, "nb_filter": 32, "activation": "relu", "activity_regularizer": null, "nb_col": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias": true, "W_constraint": null, "subsample": [1, 1], "nb_row": 3, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_3", "trainable": true, "W_regularizer": null, "nb_filter": 64, "activation": "relu", "activity_regularizer": null, "nb_col": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_3", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias": true, "W_constraint": null, "subsample": [1, 1], "nb_row": 3, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_4", "trainable": true, "W_regularizer": null, "nb_filter": 128, "activation": "relu", "activity_regularizer": null, "nb_col": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_4", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "W_constraint": null, "b_constraint": null, "output_dim": 1024, "input_dim": 512, "b_regularizer": null, "init": "glorot_uniform", "activation": "relu", "name": "dense_1", "trainable": true, "W_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "W_constraint": null, "b_constraint": null, "output_dim": 512, "input_dim": 1024, "b_regularizer": null, "init": "glorot_uniform", "activation": "relu", "name": "dense_2", "trainable": true, "W_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "W_constraint": null, "b_constraint": null, "output_dim": 1, "input_dim": 512, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "name": "output", "trainable": true, "W_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}