{"keras_version": "1.2.0", "config": [{"config": {"init": "glorot_uniform", "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 32, "subsample": [1, 1], "name": "convolution2d_1", "batch_input_shape": [null, 64, 64, 3], "bias": true, "trainable": true, "input_dtype": "float32", "activation": "relu", "nb_row": 3, "W_constraint": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "name": "convolution2d_2", "bias": true, "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "nb_row": 3, "W_constraint": null, "b_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "output_dim": 1024, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_1", "bias": true, "trainable": true, "activity_regularizer": null, "input_dim": 16384, "b_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "output_dim": 512, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_2", "bias": true, "trainable": true, "activity_regularizer": null, "input_dim": 1024, "b_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "output_dim": 1, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "output", "bias": true, "trainable": true, "activity_regularizer": null, "input_dim": 512, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}