{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "b_constraint": null, "border_mode": "valid", "batch_input_shape": [null, 100, 100, 3], "W_constraint": null, "nb_filter": 32, "activation": "elu", "activity_regularizer": null, "name": "convolution2d_1", "b_regularizer": null, "nb_col": 3, "subsample": [1, 1], "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "nb_filter": 32, "activation": "elu", "activity_regularizer": null, "name": "convolution2d_2", "b_regularizer": null, "nb_col": 3, "subsample": [1, 1], "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "nb_filter": 32, "activation": "elu", "activity_regularizer": null, "name": "convolution2d_3", "b_regularizer": null, "nb_col": 3, "subsample": [1, 1], "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "nb_filter": 64, "activation": "elu", "activity_regularizer": null, "name": "convolution2d_4", "b_regularizer": null, "nb_col": 3, "subsample": [1, 1], "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_4", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "nb_filter": 128, "activation": "elu", "activity_regularizer": null, "name": "convolution2d_5", "b_regularizer": null, "nb_col": 3, "subsample": [1, 1], "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_5", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "input_dim": 128, "output_dim": 1024, "b_regularizer": null, "activation": "elu", "activity_regularizer": null, "name": "dense_1", "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "input_dim": 1024, "output_dim": 512, "b_regularizer": null, "activation": "elu", "activity_regularizer": null, "name": "dense_2", "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "input_dim": 512, "output_dim": 1, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "name": "dense_3", "W_constraint": null}}]}