{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "input_dtype": "float32", "W_regularizer": null, "subsample": [1, 1], "nb_filter": 32, "dim_ordering": "tf", "nb_col": 3, "trainable": true, "bias": true, "activity_regularizer": null, "nb_row": 3, "name": "convolution2d_1", "init": "glorot_uniform", "batch_input_shape": [null, 64, 64, 3], "b_constraint": null, "activation": "relu", "border_mode": "same", "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "nb_col": 3, "trainable": true, "bias": true, "activity_regularizer": null, "nb_row": 3, "name": "convolution2d_2", "init": "glorot_uniform", "b_constraint": null, "activation": "relu", "border_mode": "same", "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "output_dim": 1024, "input_dim": 16384, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_1", "init": "glorot_uniform", "b_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "output_dim": 512, "input_dim": 1024, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_2", "init": "glorot_uniform", "b_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "output_dim": 1, "input_dim": 512, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "name": "output", "init": "glorot_uniform", "b_constraint": null, "activation": "linear"}}], "keras_version": "1.2.0"}