{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "b_constraint": null, "b_regularizer": null, "input_dtype": "float32", "dim_ordering": "tf", "bias": true, "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 32, "nb_row": 3, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "name": "convolution2d_1", "border_mode": "same", "batch_input_shape": [null, 32, 16, 3]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "bias": true, "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 64, "nb_row": 3, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "name": "convolution2d_2", "border_mode": "same"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "bias": true, "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null, "nb_filter": 128, "nb_row": 3, "W_regularizer": null, "init": "glorot_uniform", "activation": "relu", "name": "convolution2d_3", "border_mode": "same"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "activation": "relu", "b_constraint": null, "bias": true, "output_dim": 1024, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 1024, "name": "dense_1"}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "activation": "relu", "b_constraint": null, "bias": true, "output_dim": 512, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 1024, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "activation": "linear", "b_constraint": null, "bias": true, "output_dim": 1, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 512, "name": "output"}}]}