{"config": [{"config": {"nb_col": 3, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "nb_filter": 32, "input_dtype": "float32", "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null, "batch_input_shape": [null, 32, 16, 3]}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "nb_filter": 64, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "name": "convolution2d_2", "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "nb_filter": 128, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "name": "convolution2d_3", "dim_ordering": "tf", "border_mode": "same", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "trainable": true, "output_dim": 1024, "W_regularizer": null, "b_constraint": null, "input_dim": 1024, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "trainable": true, "output_dim": 512, "W_regularizer": null, "b_constraint": null, "input_dim": 1024, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "name": "output", "init": "glorot_uniform", "trainable": true, "output_dim": 1, "W_regularizer": null, "b_constraint": null, "input_dim": 512, "b_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}