{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "input_dtype": "float32", "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_1", "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "batch_input_shape": [null, 32, 16, 3], "nb_row": 3, "trainable": true, "nb_filter": 32, "nb_col": 3, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "border_mode": "same"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "bias": true, "name": "convolution2d_2", "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "border_mode": "same", "nb_row": 3, "b_regularizer": null, "trainable": true, "nb_filter": 64, "nb_col": 3, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "bias": true, "name": "convolution2d_3", "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "border_mode": "same", "nb_row": 3, "b_regularizer": null, "trainable": true, "nb_filter": 128, "nb_col": 3, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_1", "input_dim": 1024, "output_dim": 1024, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_2", "input_dim": 1024, "output_dim": 512, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "name": "output", "input_dim": 512, "output_dim": 1, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null}}]}