{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "border_mode": "same", "batch_input_shape": [null, 32, 16, 3], "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_1", "activation": "relu", "bias": true, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 32, "input_dtype": "float32", "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "border_mode": "same", "activation": "relu", "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_2", "bias": true, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 64, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "border_mode": "same", "activation": "relu", "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_3", "bias": true, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 128, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_3", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": 1024, "activation": "relu", "bias": true, "init": "glorot_uniform", "trainable": true, "name": "dense_1", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "output_dim": 1024, "b_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": 1024, "activation": "relu", "bias": true, "init": "glorot_uniform", "trainable": true, "name": "dense_2", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "output_dim": 512, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": 512, "activation": "linear", "bias": true, "init": "glorot_uniform", "trainable": true, "name": "output", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "output_dim": 1, "b_regularizer": null}}], "keras_version": "1.2.0"}